app/views/books/show.html.erb

SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
      <%= @book.favorites.count %> いいね

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
      <i class="fa fa-heart-o" aria-hidden="true"></i>
      <%= @book.favorites.count %> いいね

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
		</tr>
			<% @book.book_comments.each do |book_comment| %>

SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
			<td>いいねした人</td>
	<% @book.favorites.each do |favorite| %>