app/controllers/books_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
   def new
  	@book = Book.new
  	@books = Book.page(params[:page]).reverse_order
    @user = User.find(params[:id])

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "afaf"], ["body", "faf"], ["user_id", 1], ["created_at", "2019-06-22 09:01:34.145186"], ["updated_at", "2019-06-22 09:01:34.145186"]]
SELECT  "books".* FROM "books" ORDER BY "books"."id" DESC LIMIT ? OFFSET ?  [["LIMIT", 14], ["OFFSET", 0]]
---
  def create
  	@book = Book.new(book_params)
  	@book.user_id = current_user.id
  	if @book.save
      flash[:notice] = "book was successfully created "
  		redirect_to book_path(@book.id)
  	else
      @books = Book.page(params[:page]).reverse_order

SELECT "books".* FROM "books"
SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def index
  	@books = Book.all
    @book = Book.new
    @user = User.find_by(id: @book.user_id)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
  	@book = Book.find(params[:id])
    @user = User.find_by(id: @book.user_id)